syllabus.org
* syllabus
** course information
Summer 2025

606 Pratt Manhattan Campus 

M/Th 10:00 AM - 1:50 PM

5/27/2025 - 7/8/2025

Credits: 3

Prerequisites or other restrictions: INFO 664

** instructor contact information
Filipa Calado, PhD (she/her)

Office Location: Pratt Manhattan Campus, room 602

Office Hours: by appointment (summer only)

Phone: 718-687-5194

Email: fcalado@pratt.edu

Zoom: https://pratt.zoom.us/my/fcalado

Website: https://filipacalado.com 

** course description
This course offers a practical introduction to building bots in Python
alongside a critical examination of algorithmic bias. Students will
learn core programming skills like data collection and API interaction
in order to create web crawlers and social media bots. In parallel,
students will explore the ethical consequences of automated systems on
social platforms, such as the amplification of misinformation and bias
that perpetuate social inequalities and discrimination. This course
will equip students with the critical perspectives and technical
skills to analyze automated systems in a world increasingly shaped by
AI and algorithmic decision-making. This course is intended for
students interested in both technical development and the social
impacts of automation.

** student learning outcomes:
Upon successful completion of this course, students will be able to:
- develop programming literacies for working with popular software in
  Python for web crawling and API usage.
- gain hands-on experience in computational data collection and
  parsing.
- identify and explain how choices in bot design, such as source
  selection, keyword filtering, and data processing, can introduce
  and/or amplify biases.
- critically assess the societal impact of bots, especially those used
  in social media, evaluating how bots might influence information
  visibility and public discourse.

** course format
This course will be held in hybrid format, with the first four weeks
of meetings (May 29 - June 23) in person, and the last two weeks of
meetings (June 26 - July 7) on zoom.

Our sessions will be split evently between lecture, individual
practice, and group work. This contrasts with the prerequisite course,
INFO 664, which focused more heavily on lecture.

For each meeting, one 30-minute break will take place from
approximately 12:00pm-12:30pm.

** course materials
Having a personal laptop (not a tablet) where you can install software
is essential for this class.

All assignments and readings will be provided electronically and
hosted on github at https:gofilipa.github.io/how2bot.

** class communication
The instructor will contact you via your pratt email (linked to
Canvas). If you don't check that email frequently, please remember to
do so for this class or set up mail forwarding.

The best avenue for contacting the instructor is via email, at
fcalado@pratt.edu. Response time should be within 2 business days,
otherwise feel free to follow up. 

** course schedule
*** unit 1 web crawling bots - 2 weeks
**** May 29, session 1: intro to Python & web scraping with bs4

homework: find 2 scrapable sites
- find 2 websites to scrape. Make sure if they are scrapable with bs4.
  Why are you interested in this data? What could you do with it?

