syllabus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-27 Tue 15:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="fcalado" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org87f7d35">1. syllabus</a>
<ul>
<li><a href="#org3f607e9">1.1. course information</a></li>
<li><a href="#orga43ba39">1.2. instructor contact information</a></li>
<li><a href="#org067ebca">1.3. course description</a></li>
<li><a href="#orgaa4c745">1.4. student learning outcomes:</a></li>
<li><a href="#org980c1a4">1.5. course format</a></li>
<li><a href="#orgf0d7cce">1.6. course materials</a></li>
<li><a href="#org69ca9e0">1.7. class communication</a></li>
<li><a href="#org3db3dc0">1.8. course schedule</a>
<ul>
<li><a href="#org94337d4">1.8.1. unit 1 web crawling bots - 2 weeks</a></li>
<li><a href="#org86e1d90">1.8.2. unit 2 chat bots - 1.5 weeks</a></li>
<li><a href="#orgb357eff">1.8.3. unit 3 social media bots - 1.5 weeks</a></li>
<li><a href="#org4ea2c45">1.8.4. unit 4 project workshops &amp; presentations - 1 week</a></li>
</ul>
</li>
<li><a href="#orgb85ca31">1.9. assignments</a>
<ul>
<li><a href="#orgfcc5b1d">1.9.1. participation (30%)</a></li>
<li><a href="#orgde25a9a">1.9.2. unit assignments (30%)</a></li>
<li><a href="#org34ffd0a">1.9.3. final project: some bot! (40%)</a></li>
</ul>
</li>
<li><a href="#orgb6e5aaf">1.10. recommended readings</a>
<ul>
<li><a href="#orgd2bced3">1.10.1. on data gathering and web scraping</a></li>
<li><a href="#org1f673ea">1.10.2. on machine learning</a></li>
<li><a href="#org3dd866c">1.10.3. case studies of algorithmic bias &amp; audits</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org87f7d35" class="outline-2">
<h2 id="org87f7d35"><span class="section-number-2">1.</span> syllabus</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3f607e9" class="outline-3">
<h3 id="org3f607e9"><span class="section-number-3">1.1.</span> course information</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Summer 2025
</p>

<p>
606 Pratt Manhattan Campus 
</p>

<p>
M/Th 10:00 AM - 1:50 PM
</p>

<p>
5/27/2025 - 7/8/2025
</p>

<p>
Credits: 3
</p>

<p>
Prerequisites or other restrictions: INFO 664
</p>
</div>
</div>

<div id="outline-container-orga43ba39" class="outline-3">
<h3 id="orga43ba39"><span class="section-number-3">1.2.</span> instructor contact information</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Filipa Calado, PhD (she/her)
</p>

<p>
Office Location: Pratt Manhattan Campus, room 602
</p>

<p>
Office Hours: by appointment (summer only)
</p>

<p>
Phone: 718-687-5194
</p>

<p>
Email: fcalado@pratt.edu
</p>

<p>
Zoom: <a href="https://pratt.zoom.us/my/fcalado">https://pratt.zoom.us/my/fcalado</a>
</p>

<p>
Website: <a href="https://filipacalado.com">https://filipacalado.com</a> 
</p>
</div>
</div>

<div id="outline-container-org067ebca" class="outline-3">
<h3 id="org067ebca"><span class="section-number-3">1.3.</span> course description</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This course offers a practical introduction to building bots in Python
alongside a critical examination of algorithmic bias. Students will
learn core programming skills like data collection and API interaction
in order to create web crawlers and social media bots. In parallel,
students will explore the ethical consequences of automated systems on
social platforms, such as the amplification of misinformation and bias
that perpetuate social inequalities and discrimination. This course
will equip students with the critical perspectives and technical
skills to analyze automated systems in a world increasingly shaped by
AI and algorithmic decision-making. This course is intended for
students interested in both technical development and the social
impacts of automation.
</p>
</div>
</div>

<div id="outline-container-orgaa4c745" class="outline-3">
<h3 id="orgaa4c745"><span class="section-number-3">1.4.</span> student learning outcomes:</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Upon successful completion of this course, students will be able to:
</p>
<ul class="org-ul">
<li>develop programming literacies for working with popular software in
Python for web crawling and API usage.</li>
<li>gain hands-on experience in computational data collection and
parsing.</li>
<li>identify and explain how choices in bot design, such as source
selection, keyword filtering, and data processing, can introduce
and/or amplify biases.</li>
<li>critically assess the societal impact of bots, especially those used
in social media, evaluating how bots might influence information
visibility and public discourse.</li>
</ul>
</div>
</div>

<div id="outline-container-org980c1a4" class="outline-3">
<h3 id="org980c1a4"><span class="section-number-3">1.5.</span> course format</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This course will be held in hybrid format, with the first four weeks
of meetings (May 29 - June 23) in person, and the last two weeks of
meetings (June 26 - July 7) on zoom.
</p>

<p>
Our sessions will be split evently between lecture, individual
practice, and group work. This contrasts with the prerequisite course,
INFO 664, which focused more heavily on lecture.
</p>

<p>
For each meeting, one 30-minute break will take place from
approximately 12:00pm-12:30pm.
</p>
</div>
</div>

<div id="outline-container-orgf0d7cce" class="outline-3">
<h3 id="orgf0d7cce"><span class="section-number-3">1.6.</span> course materials</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Having a personal laptop (not a tablet) where you can install software
is essential for this class.
</p>

<p>
All assignments and readings will be provided electronically and
hosted on github at <a href="https:gofilipa.github.io/how2bot">https:gofilipa.github.io/how2bot</a>.
</p>
</div>
</div>

<div id="outline-container-org69ca9e0" class="outline-3">
<h3 id="org69ca9e0"><span class="section-number-3">1.7.</span> class communication</h3>
<div class="outline-text-3" id="text-1-7">
<p>
The instructor will contact you via your pratt email (linked to
Canvas). If you don't check that email frequently, please remember to
do so for this class or set up mail forwarding.
</p>

<p>
The best avenue for contacting the instructor is via email, at
fcalado@pratt.edu. Response time should be within 2 business days,
otherwise feel free to follow up. 
</p>
</div>
</div>

<div id="outline-container-org3db3dc0" class="outline-3">
<h3 id="org3db3dc0"><span class="section-number-3">1.8.</span> course schedule</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-org94337d4" class="outline-4">
<h4 id="org94337d4"><span class="section-number-4">1.8.1.</span> unit 1 web crawling bots - 2 weeks</h4>
<div class="outline-text-4" id="text-1-8-1">
</div>
<ol class="org-ol">
<li><a id="org9ac6066"></a>May 29, session 1: intro to Python &amp; web scraping with bs4<br />
<div class="outline-text-5" id="text-1-8-1-1">
<p>
homework: find 2 scrapable sites
</p>
<ul class="org-ul">
<li>find 2 websites to scrape. Make sure if they are scrapable with bs4.
Why are you interested in this data? What could you do with it?</li>
</ul>
</div>
</li>
