syllabus.org
**** June 2, session 2: scrapy & the scrapy shell

homework: reading response /Compost Engineers/ chapters 1 & 2
- Joana Varon and Lucía Egaña Rojas. Chapters 1 & 2 from /Compost
  Engineers and Sus Saberes Lentos: A Manifest for Regenerative
  Technologies/. Coding Rights, 2024,
  https://codingrights.org/docs/compost_engineers.pdf.
- Prompt: Pick an idea from the reading that interests you (either
  because you agree with it, disagree with it, or are otherwise
  provoked by it) and explain why. 1 page.

**** June 5, session 3: blockers & XHR

homework: /Compost Engineers/ chapters 3 & 4
- Joana Varon and Lucía Egaña Rojas. Chapters 3 & 4 from /Compost
  Engineers and Sus Saberes Lentos: A Manifest for Regenerative
  Technologies/. Coding Rights, 2024,
  https://codingrights.org/docs/compost_engineers.pdf.
- Prompt: From the authors' proposals, what do you find useful or
  surprising, and what do you have doubts about? 1 page.

**** June 9, session 4: selenium

assignment: web scraping
- Using either scrapy or selenium, scrape some data from a website
  that you couldn't scrape before.

*** unit 2 chat bots - 1.5 weeks
**** June 12, session 5: spaCy for processing text

homework: ACLU tech & privacy analysis write-up
- Choose a recent topic from this page; write up analysis of what is
  going on, and your opinion on the issue. How does the issue handle
  privacy rights and ethical uses of data?
  https://www.aclu.org/press-releases?issue=privacy-technology

**** June 16, session 6: spacy continued, intro to transformers 
homework: run a task on your own data

**** June 19, session 7: transformers continued

assignment: dataset proposal
- What is the dataset you'd like to create for your final project?
  Where would you get the data, and how would you transform it? You
  can consider tools from this class (like text generation, named
  entity recognition, pattern matching), or you can consider other
  possibilities for transforming your data. 1 page, double spaced.

*** unit 3 social media bots - 1.5 weeks
**** June 23, session 8: twitter bots

homework: make a plan for actions steps by next class

**** (online) June 26, session 9: group projects

homework: work on projects

**** (online) June 30, session 10: group projects continued

homework: project proposal

*** unit 4 project workshops & presentations - 1 week
**** (online) July 3, final projects

homework: work on projects

**** (online) July 7, final project presentations

** assignments
*** participation (30%)
- Includes in-class engagement, and completing and sharing homework
*** unit assignments (30%)
- Average score of 3 assignments at the end of units 1-3
*** final project: some bot! (40%)
- A final project that takes some data from web scraping or APIs, and
  uses it as the content for a bot.
- bot to be automated and published on github. 

** recommended readings
