syllabus.html

<li><a id="org2709666"></a>June 2, session 2: scrapy &amp; the scrapy shell<br />
<div class="outline-text-5" id="text-1-8-1-2">
<p>
homework: reading response <i>Compost Engineers</i> chapters 1 &amp; 2
</p>
<ul class="org-ul">
<li>Joana Varon and Lucía Egaña Rojas. Chapters 1 &amp; 2 from <i>Compost
Engineers and Sus Saberes Lentos: A Manifest for Regenerative
Technologies</i>. Coding Rights, 2024,
<a href="https://codingrights.org/docs/compost_engineers.pdf">https://codingrights.org/docs/compost_engineers.pdf</a>.</li>
<li>Prompt: Pick an idea from the reading that interests you (either
because you agree with it, disagree with it, or are otherwise
provoked by it) and explain why. 1 page.</li>
</ul>
</div>
</li>

<li><a id="orgb48cd43"></a>June 5, session 3: blockers &amp; XHR<br />
<div class="outline-text-5" id="text-1-8-1-3">
<p>
homework: <i>Compost Engineers</i> chapters 3 &amp; 4
</p>
<ul class="org-ul">
<li>Joana Varon and Lucía Egaña Rojas. Chapters 3 &amp; 4 from <i>Compost
Engineers and Sus Saberes Lentos: A Manifest for Regenerative
Technologies</i>. Coding Rights, 2024,
<a href="https://codingrights.org/docs/compost_engineers.pdf">https://codingrights.org/docs/compost_engineers.pdf</a>.</li>
<li>Prompt: From the authors' proposals, what do you find useful or
surprising, and what do you have doubts about? 1 page.</li>
</ul>
</div>
</li>

<li><a id="org264c226"></a>June 9, session 4: selenium<br />
<div class="outline-text-5" id="text-1-8-1-4">
<p>
assignment: web scraping
</p>
<ul class="org-ul">
<li>Using either scrapy or selenium, scrape some data from a website
that you couldn't scrape before.</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org86e1d90" class="outline-4">
<h4 id="org86e1d90"><span class="section-number-4">1.8.2.</span> unit 2 chat bots - 1.5 weeks</h4>
<div class="outline-text-4" id="text-1-8-2">
</div>
<ol class="org-ol">
<li><a id="orgcdbf865"></a>June 12, session 5: spaCy for processing text<br />
<div class="outline-text-5" id="text-1-8-2-1">
<p>
homework: ACLU tech &amp; privacy analysis write-up
</p>
<ul class="org-ul">
<li>Choose a recent topic from this page; write up analysis of what is
going on, and your opinion on the issue. How does the issue handle
privacy rights and ethical uses of data?
<a href="https://www.aclu.org/press-releases?issue=privacy-technology">https://www.aclu.org/press-releases?issue=privacy-technology</a></li>
</ul>
</div>
</li>

<li><a id="orgd614e54"></a>June 16, session 6: spacy continued, intro to transformers<br />
<div class="outline-text-5" id="text-1-8-2-2">
<p>
homework: run a task on your own data
</p>
</div>
</li>

<li><a id="org6994198"></a>June 19, session 7: transformers continued<br />
<div class="outline-text-5" id="text-1-8-2-3">
<p>
assignment: dataset proposal
</p>
<ul class="org-ul">
<li>What is the dataset you'd like to create for your final project?
Where would you get the data, and how would you transform it? You
can consider tools from this class (like text generation, named
entity recognition, pattern matching), or you can consider other
possibilities for transforming your data. 1 page, double spaced.</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgb357eff" class="outline-4">
<h4 id="orgb357eff"><span class="section-number-4">1.8.3.</span> unit 3 social media bots - 1.5 weeks</h4>
<div class="outline-text-4" id="text-1-8-3">
</div>
<ol class="org-ol">
<li><a id="org7ff1797"></a>June 23, session 8: twitter bots<br />
<div class="outline-text-5" id="text-1-8-3-1">
<p>
homework: make a plan for actions steps by next class
</p>
</div>
</li>

<li><a id="org1104927"></a>(online) June 26, session 9: group projects<br />
<div class="outline-text-5" id="text-1-8-3-2">
<p>
homework: work on projects
</p>
</div>
</li>

<li><a id="orgd60484a"></a>(online) June 30, session 10: group projects continued<br />
<div class="outline-text-5" id="text-1-8-3-3">
<p>
homework: project proposal
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org4ea2c45" class="outline-4">
<h4 id="org4ea2c45"><span class="section-number-4">1.8.4.</span> unit 4 project workshops &amp; presentations - 1 week</h4>
<div class="outline-text-4" id="text-1-8-4">
</div>
<ol class="org-ol">
<li><a id="org607cce8"></a>(online) July 3, final projects<br />
<div class="outline-text-5" id="text-1-8-4-1">
<p>
homework: work on projects
</p>
</div>
</li>

<li><a id="orgbb693d4"></a>(online) July 7, final project presentations<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgb85ca31" class="outline-3">
<h3 id="orgb85ca31"><span class="section-number-3">1.9.</span> assignments</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-orgfcc5b1d" class="outline-4">
<h4 id="orgfcc5b1d"><span class="section-number-4">1.9.1.</span> participation (30%)</h4>
<div class="outline-text-4" id="text-1-9-1">
<ul class="org-ul">
<li>Includes in-class engagement, and completing and sharing homework</li>
</ul>
</div>
</div>
<div id="outline-container-orgde25a9a" class="outline-4">
<h4 id="orgde25a9a"><span class="section-number-4">1.9.2.</span> unit assignments (30%)</h4>
<div class="outline-text-4" id="text-1-9-2">
<ul class="org-ul">
<li>Average score of 3 assignments at the end of units 1-3</li>
</ul>
</div>
</div>
<div id="outline-container-org34ffd0a" class="outline-4">
<h4 id="org34ffd0a"><span class="section-number-4">1.9.3.</span> final project: some bot! (40%)</h4>
<div class="outline-text-4" id="text-1-9-3">
<ul class="org-ul">
<li>A final project that takes some data from web scraping or APIs, and
uses it as the content for a bot.</li>
<li>bot to be automated and published on github.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb6e5aaf" class="outline-3">
<h3 id="orgb6e5aaf"><span class="section-number-3">1.10.</span> recommended readings</h3>
<div class="outline-text-3" id="text-1-10">
</div>
