syllabus.tex

\item June 2, session 2: scrapy \& the scrapy shell
\label{sec:org5bf504e}

homework: reading response \emph{Compost Engineers} chapters 1 \& 2
\begin{itemize}
\item Joana Varon and Lucía Egaña Rojas. Chapters 1 \& 2 from \emph{Compost
Engineers and Sus Saberes Lentos: A Manifest for Regenerative
Technologies}. Coding Rights, 2024,
\url{https://codingrights.org/docs/compost\_engineers.pdf}.
\item Prompt: Pick an idea from the reading that interests you (either
because you agree with it, disagree with it, or are otherwise
provoked by it) and explain why. 1 page.
\end{itemize}

\item June 5, session 3: blockers \& XHR
\label{sec:orga08632a}

homework: \emph{Compost Engineers} chapters 3 \& 4
\begin{itemize}
\item Joana Varon and Lucía Egaña Rojas. Chapters 3 \& 4 from \emph{Compost
Engineers and Sus Saberes Lentos: A Manifest for Regenerative
Technologies}. Coding Rights, 2024,
\url{https://codingrights.org/docs/compost\_engineers.pdf}.
\item Prompt: From the authors' proposals, what do you find useful or
surprising, and what do you have doubts about? 1 page.
\end{itemize}

\item June 9, session 4: selenium
\label{sec:org85431e1}

assignment: web scraping
\begin{itemize}
\item Using either scrapy or selenium, scrape some data from a website
that you couldn't scrape before.
\end{itemize}
\end{enumerate}

\subsubsection{unit 2 chat bots - 1.5 weeks}
\label{sec:org1b15ebc}
\begin{enumerate}
\item June 12, session 5: spaCy for processing text
\label{sec:orgf5b4ba2}

homework: ACLU tech \& privacy analysis write-up
\begin{itemize}
\item Choose a recent topic from this page; write up analysis of what is
going on, and your opinion on the issue. How does the issue handle
privacy rights and ethical uses of data?
\url{https://www.aclu.org/press-releases?issue=privacy-technology}
\end{itemize}

\item June 16, session 6: spacy continued, intro to transformers
\label{sec:org5f3bdf9}
homework: run a task on your own data

\item June 19, session 7: transformers continued
\label{sec:org00d8e05}

assignment: dataset proposal
\begin{itemize}
\item What is the dataset you'd like to create for your final project?
Where would you get the data, and how would you transform it? You
can consider tools from this class (like text generation, named
entity recognition, pattern matching), or you can consider other
possibilities for transforming your data. 1 page, double spaced.
\end{itemize}
\end{enumerate}

\subsubsection{unit 3 social media bots - 1.5 weeks}
\label{sec:org1f8ac74}
\begin{enumerate}
\item June 23, session 8: twitter bots
\label{sec:org15265f2}

homework: make a plan for actions steps by next class

\item (online) June 26, session 9: group projects
\label{sec:orge954c33}

homework: work on projects

\item (online) June 30, session 10: group projects continued
\label{sec:org4c91f5e}

homework: project proposal
\end{enumerate}

\subsubsection{unit 4 project workshops \& presentations - 1 week}
\label{sec:orgff9d547}
\begin{enumerate}
\item (online) July 3, final projects
\label{sec:org3b71eba}

homework: work on projects

\item (online) July 7, final project presentations
\label{sec:org644bc4e}
\end{enumerate}

\subsection{assignments}
\label{sec:orgdf94890}
\subsubsection{participation (30\%)}
\label{sec:org599c846}
\begin{itemize}
\item Includes in-class engagement, and completing and sharing homework
\end{itemize}
\subsubsection{unit assignments (30\%)}
\label{sec:org7d6ca43}
\begin{itemize}
\item Average score of 3 assignments at the end of units 1-3
\end{itemize}
\subsubsection{final project: some bot! (40\%)}
\label{sec:org67e1a46}
\begin{itemize}
\item A final project that takes some data from web scraping or APIs, and
uses it as the content for a bot.
\item bot to be automated and published on github.
\end{itemize}

\subsection{recommended readings}
\label{sec:org0e7001c}
