syllabus.html
<div id="outline-container-orgd2bced3" class="outline-4">
<h4 id="orgd2bced3"><span class="section-number-4">1.10.1.</span> on data gathering and web scraping</h4>
<div class="outline-text-4" id="text-1-10-1">
<ul class="org-ul">
<li>Dodge, Jesse, et al. “Documenting Large Webtext Corpora: A Case
Study on the Colossal Clean Crawled Corpus.” Proceedings of the 2021
Conference on Empirical Methods in Natural Language Processing,
edited by Marie-Francine Moens et al., Association for Computational
Linguistics, 2021, pp. 1286–305. ACLWeb,
<a href="https://doi.org/10.18653/v1/2021.emnlp-main.98">https://doi.org/10.18653/v1/2021.emnlp-main.98</a>.</li>
<li>Jo, Eun Seo, and Timnit Gebru. “Lessons from Archives: Strategies
for Collecting Sociocultural Data in Machine Learning.” Proceedings
of the 2020 Conference on Fairness, Accountability, and
Transparency, Association for Computing Machinery, 2020, pp. 306–16.
ACM Digital Library, <a href="https://doi.org/10.1145/3351095.3372829">https://doi.org/10.1145/3351095.3372829</a>.</li>
<li>Chan, Anita Say. Predatory Data: Eugenics in Big Tech and Our Fight
for an Independent Future. University of California Press, 2025.
library.oapen.org, <a href="https://doi.org/10.1525/luminos.215">https://doi.org/10.1525/luminos.215</a>.</li>
<li>Métraux, Julia. “Eugenics Isn’t Dead—It’s Thriving in Tech.” Mother
Jones,
<a href="https://www.motherjones.com/politics/2025/01/eugenics-isnt-dead-its-thriving-in-tech/">https://www.motherjones.com/politics/2025/01/eugenics-isnt-dead-its-thriving-in-tech/</a>.
Accessed 14 Feb. 2025.</li>
</ul>
</div>
</div>

<div id="outline-container-org1f673ea" class="outline-4">
<h4 id="org1f673ea"><span class="section-number-4">1.10.2.</span> on machine learning</h4>
<div class="outline-text-4" id="text-1-10-2">
<ul class="org-ul">
<li>Alammar, Jay. The Illustrated BERT, ELMo, and Co. (How NLP Cracked
Transfer Learning). <a href="https://jalammar.github.io/illustrated-bert/">https://jalammar.github.io/illustrated-bert/</a>.
Accessed 14 Apr. 2025.</li>
<li>Alammar, Jay. The Illustrated DeepSeek-R1. 10 Feb. 2025,
<a href="https://newsletter.languagemodels.co/p/the-illustrated-deepseek-r1">https://newsletter.languagemodels.co/p/the-illustrated-deepseek-r1</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org3dd866c" class="outline-4">
<h4 id="org3dd866c"><span class="section-number-4">1.10.3.</span> case studies of algorithmic bias &amp; audits</h4>
<div class="outline-text-4" id="text-1-10-3">
<ul class="org-ul">
<li>Hada, Rishav, et al. “Akal Badi Ya Bias: An Exploratory Study of
Gender Bias in Hindi Language Technology.” The 2024 ACM Conference
on Fairness, Accountability, and Transparency, ACM, 2024, pp.
1926–39. DOI.org (Crossref),
<a href="https://doi.org/10.1145/3630106.3659017">https://doi.org/10.1145/3630106.3659017</a>.</li>
<li>Gajjala, Radhika, et al. “Get the Hammer out! Breaking Computational
Tools for Feminist, Intersectional ‘Small Data’ Research.” Journal
of Digital Social Research, vol. 6, no. 2, 2, May 2024, pp. 9–26.
jdsr.se, <a href="https://doi.org/10.33621/jdsr.v6i2.193">https://doi.org/10.33621/jdsr.v6i2.193</a>.</li>
<li>Tang, Ningjing, et al. “AI Failure Cards: Understanding and
Supporting Grassroots Efforts to Mitigate AI Failures in Homeless
Services.” The 2024 ACM Conference on Fairness, Accountability, and
Transparency, ACM, 2024, pp. 713–32. DOI.org (Crossref),
<a href="https://doi.org/10.1145/3630106.3658935">https://doi.org/10.1145/3630106.3658935</a>.</li>
<li>Groves, Lara, et al. “Auditing Work: Exploring the New York City
Algorithmic Bias Audit Regime.” The 2024 ACM Conference on Fairness,
Accountability, and Transparency, ACM, 2024, pp. 1107–20. DOI.org
(Crossref), <a href="https://doi.org/10.1145/3630106.3658959">https://doi.org/10.1145/3630106.3658959</a>.</li>
<li>Costanza-Chock, Sasha, et al. “Who Audits the Auditors?
Recommendations from a Field Scan of the Algorithmic Auditing
Ecosystem.” Proceedings of the 2022 ACM Conference on Fairness,
Accountability, and Transparency, Association for Computing
Machinery, 2022, pp. 1571–83. ACM Digital Library,
<a href="https://doi.org/10.1145/3531146.3533213">https://doi.org/10.1145/3531146.3533213</a>.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: fcalado</p>
<p class="date">Created: 2025-05-27 Tue 15:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
