syllabus.tex
\subsubsection{on data gathering and web scraping}
\label{sec:org24293ca}
\begin{itemize}
\item Dodge, Jesse, et al. “Documenting Large Webtext Corpora: A Case
Study on the Colossal Clean Crawled Corpus.” Proceedings of the 2021
Conference on Empirical Methods in Natural Language Processing,
edited by Marie-Francine Moens et al., Association for Computational
Linguistics, 2021, pp. 1286–305. ACLWeb,
\url{https://doi.org/10.18653/v1/2021.emnlp-main.98}.
\item Jo, Eun Seo, and Timnit Gebru. “Lessons from Archives: Strategies
for Collecting Sociocultural Data in Machine Learning.” Proceedings
of the 2020 Conference on Fairness, Accountability, and
Transparency, Association for Computing Machinery, 2020, pp. 306–16.
ACM Digital Library, \url{https://doi.org/10.1145/3351095.3372829}.
\item Chan, Anita Say. Predatory Data: Eugenics in Big Tech and Our Fight
for an Independent Future. University of California Press, 2025.
library.oapen.org, \url{https://doi.org/10.1525/luminos.215}.
\item Métraux, Julia. “Eugenics Isn’t Dead—It’s Thriving in Tech.” Mother
Jones,
\url{https://www.motherjones.com/politics/2025/01/eugenics-isnt-dead-its-thriving-in-tech/}.
Accessed 14 Feb. 2025.
\end{itemize}

\subsubsection{on machine learning}
\label{sec:orgb559504}
\begin{itemize}
\item Alammar, Jay. The Illustrated BERT, ELMo, and Co. (How NLP Cracked
Transfer Learning). \url{https://jalammar.github.io/illustrated-bert/}.
Accessed 14 Apr. 2025.
\item Alammar, Jay. The Illustrated DeepSeek-R1. 10 Feb. 2025,
\url{https://newsletter.languagemodels.co/p/the-illustrated-deepseek-r1}.
\end{itemize}

\subsubsection{case studies of algorithmic bias \& audits}
\label{sec:org780eecf}
\begin{itemize}
\item Hada, Rishav, et al. “Akal Badi Ya Bias: An Exploratory Study of
Gender Bias in Hindi Language Technology.” The 2024 ACM Conference
on Fairness, Accountability, and Transparency, ACM, 2024, pp.
1926–39. DOI.org (Crossref),
\url{https://doi.org/10.1145/3630106.3659017}.
\item Gajjala, Radhika, et al. “Get the Hammer out! Breaking Computational
Tools for Feminist, Intersectional ‘Small Data’ Research.” Journal
of Digital Social Research, vol. 6, no. 2, 2, May 2024, pp. 9–26.
jdsr.se, \url{https://doi.org/10.33621/jdsr.v6i2.193}.
\item Tang, Ningjing, et al. “AI Failure Cards: Understanding and
Supporting Grassroots Efforts to Mitigate AI Failures in Homeless
Services.” The 2024 ACM Conference on Fairness, Accountability, and
Transparency, ACM, 2024, pp. 713–32. DOI.org (Crossref),
\url{https://doi.org/10.1145/3630106.3658935}.
\item Groves, Lara, et al. “Auditing Work: Exploring the New York City
Algorithmic Bias Audit Regime.” The 2024 ACM Conference on Fairness,
Accountability, and Transparency, ACM, 2024, pp. 1107–20. DOI.org
(Crossref), \url{https://doi.org/10.1145/3630106.3658959}.
\item Costanza-Chock, Sasha, et al. “Who Audits the Auditors?
Recommendations from a Field Scan of the Algorithmic Auditing
Ecosystem.” Proceedings of the 2022 ACM Conference on Fairness,
Accountability, and Transparency, Association for Computing
Machinery, 2022, pp. 1571–83. ACM Digital Library,
\url{https://doi.org/10.1145/3531146.3533213}.
\end{itemize}
\end{document}
